'''Задача 4. Напишите программу с классом Car. Создайте конструктор класса Car. Создайте атрибуты класса Car — color (цвет), type (тип), year (год).
Напишите пять методов. Первый — запуск автомобиля, при его вызове выводится сообщение «Автомобиль заведен». Второй — отключение автомобиля —
выводит сообщение «Автомобиль заглушен». Третий — присвоение автомобилю года выпуска. Четвертый метод — присвоение автомобилю типа. Пятый —
присвоение автомобилю цвета. Затем, добавьте еще один атрибут - "пробег" (по умолчанию == 0) и атрибут "бензин" (по умолчанию 30 - количество
литров в баке) и "объем бака" (по умолчанию 60).
Добавьте метод "ехать", аргументом которого будет расстояние в км, например go_car(self,
distance=15). Метод должен 1) определять, может ли машина ехать (есть ли бензин - читать дальше), если может - добавлять дистанцию к атрибуту
"пробег" и отнимать от атрибута "бензин" по формуле (литраж делим на километраж и умножаем на сто – л/км*100). Если машина ехать не может -
вывести текст "закончился бензин". Добавить методы для проверки бензина в баке, для проверки пробега автомобиля и для заправки автомобиля
(атрибуту "бензин" обновляем значение) '''

class Car():
    def __init__(self, color, type, year):
        self.color = color
        self.type = type
        self.year = year

    def start(self):
        print('Автомобиль заведен')

    def stop(self):
        print("Автомобиль заглушен")

    def set_type(self, type):
        self.type = type

    def go_car(self, distance=15):
        if self.gasoline > 0:

            print("we can run, our gasoline is ", self.gasoline)
        else:
            print("the gasoline end")


car = Car('черный', 'легковая', 2010)
car1 = Car('red', 'легковая', 2000)

car.start()
car.stop()
print(car.type)
car.set_type('на газу')
print(car.type)

car.running = 0
print(car.running)
car.gasoline =30
car.tank = 60

car.go_car()



